## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.DownloadFFISSpreadsheet.data.aws_s3_bucket.download_target will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "download_target" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.data.aws_sqs_queue.ffis_downloads will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sqs_queue" "ffis_downloads" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "grants_ingest-ffis_downloads"
+       tags = (known after apply)
+       url  = (known after apply)
    }

  # module.EnqueueFFISDownload.data.aws_s3_bucket.source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.EnqueueFFISDownload.data.aws_sqs_queue.ffis_downloads will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sqs_queue" "ffis_downloads" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "grants_ingest-ffis_downloads"
+       tags = (known after apply)
+       url  = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.data.aws_s3_bucket.source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.PersistFFISData.data.aws_s3_bucket.prepared_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "prepared_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantsprepareddata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.ReceiveFFISEmail.data.aws_s3_bucket.email_delivery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "email_delivery" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-emaildelivery-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.ReceiveFFISEmail.data.aws_s3_bucket.grants_source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "grants_source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.SplitFFISSpreadsheet.data.aws_s3_bucket.prepared_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "prepared_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantsprepareddata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.SplitFFISSpreadsheet.data.aws_s3_bucket.source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.email_delivery_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "default" {
        id     = "grantsingest-emaildelivery-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

+           filter {
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.grants_prepared_data_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "default" {
        id     = "grantsingest-grantsprepareddata-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

+           filter {
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.grants_source_data_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "default" {
        id     = "grantsingest-grantssourcedata-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

+           filter {
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.lambda_artifacts_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "default" {
        id     = "grantsingest-lambdaartifacts-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

+           filter {
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.data.archive_file.local_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "local_zip" {
+       id                  = (known after apply)
+       output_base64sha256 = (known after apply)
+       output_base64sha512 = (known after apply)
+       output_file_mode    = "0644"
+       output_md5          = (known after apply)
+       output_path         = "./builds/DownloadFFISSpreadsheet.zip"
+       output_sha          = (known after apply)
+       output_sha256       = (known after apply)
+       output_sha512       = (known after apply)
+       output_size         = (known after apply)
+       source_file         = "./../bin/DownloadFFISSpreadsheet/bootstrap"
+       type                = "zip"
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "993eeb6712644b2e37d342a109f95209-3" -> (known after apply)
      ~ id                     = "7290a07a66a8bfd402173c9c4086a732.zip" -> (known after apply)
      ~ key                    = "7290a07a66a8bfd402173c9c4086a732.zip" # forces replacement -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "hJtY_FHFmtdR0T6FpTdWFSB2L1WaBh8w" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3DownloadWrite"
        }
+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowSQSGet"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-DownloadFFISSpreadsheet:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-DownloadFFISSpreadsheet:*:*",
            ]
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-DownloadFFISSpreadsheet"
        name      = "grants_ingest-DownloadFFISSpreadsheet"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis.org/download.xlsx"
-                       Sid      = "AllowS3DownloadWrite"
                    },
-                   {
-                       Action   = [
-                           "sqs:ReceiveMessage",
-                           "sqs:GetQueueAttributes",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:grants_ingest-ffis_downloads"
-                       Sid      = "AllowSQSGet"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-DownloadFFISSpreadsheet-logs"
        name      = "grants_ingest-DownloadFFISSpreadsheet-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-DownloadFFISSpreadsheet:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-DownloadFFISSpreadsheet:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-DownloadFFISSpreadsheet"
        name                  = "grants_ingest-DownloadFFISSpreadsheet"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] must be replaced
-/+ resource "aws_lambda_event_source_mapping" "this" {
-       bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:us-west-2:357150818708:grants_ingest-ffis_downloads" # forces replacement -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet" -> (known after apply)
-       function_response_types            = [] -> null
      ~ id                                 = "8fcae69a-480f-4f26-9f69-376a2388ac13" -> (known after apply)
      ~ last_modified                      = "2023-09-19T18:48:50Z" -> (known after apply)
+       last_processing_result             = (known after apply)
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
-       queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
-       topics                             = [] -> null
-       tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "8fcae69a-480f-4f26-9f69-376a2388ac13" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-12-12T00:31:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:44/invocations" -> (known after apply)
      ~ s3_key                         = "7290a07a66a8bfd402173c9c4086a732.zip" -> (known after apply)
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
-               "DD_APM_ENABLED"               = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
-               "DD_ENV"                       = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
-               "DD_SERVICE"                   = "grants-ingest"
-               "DD_SITE"                      = "datadoghq.com"
-               "DD_TAGS"                      = "git.commit.sha:99eec77070b39503ce2d014af683a163b789c764,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
-               "DD_TRACE_ENABLED"             = "true"
-               "DD_VERSION"                   = "99eec77070b39503ce2d014af683a163b789c764"
-               "LOG_LEVEL"                    = "INFO"
-               "TARGET_BUCKET_NAME"           = "grantsingest-grantssourcedata-357150818708-us-west-2"
-               "TZ"                           = "UTC"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "44" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "7b2fc9b74d480b88aab4bb7e6f37e01b-3" -> (known after apply)
      ~ id                     = "11c9f5fd6e7f78ca91757034614a7e40.zip" -> (known after apply)
      ~ key                    = "11c9f5fd6e7f78ca91757034614a7e40.zip" -> "f1c9bf8022c581e61f123819c7f6fe28.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "9mM7RbWxZLQfiI2dIXIPQvOC5XQqPhzN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-12-12T00:31:38.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:44/invocations" -> (known after apply)
      ~ s3_key                         = "11c9f5fd6e7f78ca91757034614a7e40.zip" -> "f1c9bf8022c581e61f123819c7f6fe28.zip"
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:99eec77070b39503ce2d014af683a163b789c764,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:6ec13c8ae2be5c0e95afd59d69d4ee72bc195885,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "99eec77070b39503ce2d014af683a163b789c764" -> "6ec13c8ae2be5c0e95afd59d69d4ee72bc195885"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "44" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.data.archive_file.local_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "local_zip" {
+       id                  = (known after apply)
+       output_base64sha256 = (known after apply)
+       output_base64sha512 = (known after apply)
+       output_file_mode    = "0644"
+       output_md5          = (known after apply)
+       output_path         = "./builds/EnqueueFFISDownload.zip"
+       output_sha          = (known after apply)
+       output_sha256       = (known after apply)
+       output_sha512       = (known after apply)
+       output_size         = (known after apply)
+       source_file         = "./../bin/EnqueueFFISDownload/bootstrap"
+       type                = "zip"
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f3281026830e414df1aa3bcf98d0fdd0-3" -> (known after apply)
      ~ id                     = "7e15e9b2dc3918efa7ae8a01349ec644.zip" -> (known after apply)
      ~ key                    = "7e15e9b2dc3918efa7ae8a01349ec644.zip" # forces replacement -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "X8j9k21HRbkQLGlPs.w6KJQF7yB_Knyz" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3DownloadSourceData"
        }
+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowSQSPublish"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-EnqueueFFISDownload:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-EnqueueFFISDownload:*:*",
            ]
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-EnqueueFFISDownload"
        name      = "grants_ingest-EnqueueFFISDownload"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis.org/raw.eml"
-                       Sid      = "AllowS3DownloadSourceData"
                    },
-                   {
-                       Action   = "sqs:SendMessage"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:grants_ingest-ffis_downloads"
-                       Sid      = "AllowSQSPublish"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-EnqueueFFISDownload-logs"
        name      = "grants_ingest-EnqueueFFISDownload-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-EnqueueFFISDownload:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-EnqueueFFISDownload:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-EnqueueFFISDownload"
        name                  = "grants_ingest-EnqueueFFISDownload"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2023-12-12T00:31:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:44/invocations" -> (known after apply)
      ~ s3_key                         = "7e15e9b2dc3918efa7ae8a01349ec644.zip" -> (known after apply)
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
-               "DD_APM_ENABLED"               = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
-               "DD_ENV"                       = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
-               "DD_SERVICE"                   = "grants-ingest"
-               "DD_SITE"                      = "datadoghq.com"
-               "DD_TAGS"                      = "git.commit.sha:99eec77070b39503ce2d014af683a163b789c764,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
-               "DD_TRACE_ENABLED"             = "true"
-               "DD_VERSION"                   = "99eec77070b39503ce2d014af683a163b789c764"
-               "FFIS_SQS_QUEUE_URL"           = "https://sqs.us-west-2.amazonaws.com/357150818708/grants_ingest-ffis_downloads"
-               "LOG_LEVEL"                    = "INFO"
-               "TZ"                           = "UTC"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "44" # forces replacement -> (known after apply) # forces replacement
      ~ source_arn          = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.data.archive_file.local_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "local_zip" {
+       id                  = (known after apply)
+       output_base64sha256 = (known after apply)
+       output_base64sha512 = (known after apply)
+       output_file_mode    = "0644"
+       output_md5          = (known after apply)
+       output_path         = "./builds/ExtractGrantsGovDBToXML.zip"
+       output_sha          = (known after apply)
+       output_sha256       = (known after apply)
+       output_sha512       = (known after apply)
+       output_size         = (known after apply)
+       source_file         = "./../bin/ExtractGrantsGovDBToXML/bootstrap"
+       type                = "zip"
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9a0f2fd85c8bb2138443de480f4a3ba8-3" -> (known after apply)
      ~ id                     = "c6fb130ec8aafe3db18fadcb34bef579.zip" -> (known after apply)
      ~ key                    = "c6fb130ec8aafe3db18fadcb34bef579.zip" # forces replacement -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "j1pKNSv_UBAp5faQLWsb4TCedmworcUX" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3DownloadSourceData"
        }
+       statement {
+           actions   = [
+               "s3:DeleteObject",
+               "s3:GetObject",
+               "s3:GetObjectTagging",
+               "s3:PutObject",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3UploadAndMoveTemporaryData"
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
+               "s3:PutObjectTagging",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3UploadSourceData"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-ExtractGrantsGovDBToXML:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-ExtractGrantsGovDBToXML:*:*",
            ]
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-ExtractGrantsGovDBToXML"
        name      = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/archive.zip"
-                       Sid      = "AllowS3DownloadSourceData"
                    },
-                   {
-                       Action   = [
-                           "s3:PutObject",
-                           "s3:GetObjectTagging",
-                           "s3:GetObject",
-                           "s3:DeleteObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2/tmp/sources/*/*/*/grants.gov/extract.xml"
-                       Sid      = "AllowS3UploadAndMoveTemporaryData"
                    },
-                   {
-                       Action   = [
-                           "s3:PutObjectTagging",
-                           "s3:PutObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/extract.xml"
-                       Sid      = "AllowS3UploadSourceData"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-ExtractGrantsGovDBToXML-logs"
        name      = "grants_ingest-ExtractGrantsGovDBToXML-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-ExtractGrantsGovDBToXML:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-ExtractGrantsGovDBToXML:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-ExtractGrantsGovDBToXML"
        name                  = "grants_ingest-ExtractGrantsGovDBToXML"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-12-12T00:31:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:44/invocations" -> (known after apply)
      ~ s3_key                         = "c6fb130ec8aafe3db18fadcb34bef579.zip" -> (known after apply)
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:99eec77070b39503ce2d014af683a163b789c764,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:6ec13c8ae2be5c0e95afd59d69d4ee72bc195885,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "99eec77070b39503ce2d014af683a163b789c764" -> "6ec13c8ae2be5c0e95afd59d69d4ee72bc195885"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "44" # forces replacement -> (known after apply) # forces replacement
      ~ source_arn          = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::grantsingest-grantssourcedata-357150818708-us-west-2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.data.archive_file.local_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "local_zip" {
+       id                  = (known after apply)
+       output_base64sha256 = (known after apply)
+       output_base64sha512 = (known after apply)
+       output_file_mode    = "0644"
+       output_md5          = (known after apply)
+       output_path         = "./builds/PersistFFISData.zip"
+       output_sha          = (known after apply)
+       output_sha256       = (known after apply)
+       output_sha512       = (known after apply)
+       output_size         = (known after apply)
+       source_file         = "./../bin/PersistFFISData/bootstrap"
+       type                = "zip"
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9888fcf6dab1dabd77fd2136ac3bee99-3" -> (known after apply)
      ~ id                     = "374b393b81b85a167738a2789ed6cc51.zip" -> (known after apply)
      ~ key                    = "374b393b81b85a167738a2789ed6cc51.zip" # forces replacement -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "oVEIZVJwUGDARi7CPyxACN7.tCrT91AN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions   = [
+               "dynamodb:ListTables",
+               "dynamodb:UpdateItem",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-prepareddata",
            ]
+           sid       = "AllowDynamoDBPreparedData"
        }
+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowGetS3PreparedData"
        }
    }

  # module.PersistFFISData.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.PersistFFISData.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-PersistFFISData:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-PersistFFISData:*:*",
            ]
        }
    }

  # module.PersistFFISData.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-PersistFFISData"
        name      = "grants_ingest-PersistFFISData"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-datadog_api_key-8kMn2C"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = [
-                           "dynamodb:UpdateItem",
-                           "dynamodb:ListTables",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:dynamodb:us-west-2:357150818708:table/grantsingest-prepareddata"
-                       Sid      = "AllowDynamoDBPreparedData"
                    },
-                   {
-                       Action   = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::grantsingest-grantsprepareddata-357150818708-us-west-2/*/*/ffis.org/v1.json",
-                           "arn:aws:s3:::grantsingest-grantsprepareddata-357150818708-us-west-2",
                        ]
-                       Sid      = "AllowGetS3PreparedData"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-PersistFFISData-logs"
        name      = "grants_ingest-PersistFFISData-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-PersistFFISData:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-PersistFFISData:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-PersistFFISData"
        name                  = "grants_ingest-PersistFFISData"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2023-12-12T00:31:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:44/invocations" -> (known after apply)
      ~ s3_key                         = "374b393b81b85a167738a2789ed6cc51.zip" -> (known after apply)
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:99eec77070b39503ce2d014af683a163b789c764,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:6ec13c8ae2be5c0e95afd59d69d4ee72bc195885,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "99eec77070b39503ce2d014af683a163b789c764" -> "6ec13c8ae2be5c0e95afd59d69d4ee72bc195885"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_la...*[Comment body truncated]*